// <BoardData,js>는 게시판 데이터를 JSON 구조로 만든 파일이다.

let boardData = new Object


boardData = {

    "data" : [

        {
            'num' : '2',
            title:'[공고] 신주발행 공고(제3자 배정방식)',
            date: '2021-01-07',
            lawContent : '상법 제416조에 의거 2021년 1월 7일에 개최한 주식회사 팀프레시의 이사회에서 아래와 같이 신주발행을 결의하였음을 공고합니다.',
            no1Content : '신주의 종류와 수 : 제2종 상환전환우선주식 4,370주',
            no2Content : '신주의 액면가액 : 금 5,000원',
            no3Content : '신주식 발행가액 : 금 457,650원',
            no4Content : '신주배정기준일 : 2021년 1월 22일',
            no5Content : '납입예정일 : 2021년 1월 22일',
            no6Content : '주금납입은행 :  국민은행  송파종합금융센터 지점',
            no7Content : '정관 제18조의 제2항 7호 규정에 의거하여 제3자에게 신주식을 발행한다.',
            no8Content : '신주식을 배정받을 제3자, 부여할 신주의 종류와 수량',
            no1LastContent : '스틱청년일자리펀드, 제2종 상환전환우선주식 1,175주',
            no2LastContent : '스틱4차산업혁명 jump-up 펀드, 제2종 상환전환우선주식 3,195주',
            company : '주식회사 팀프레시',
            address : '서울특별시 송파구 위례성대로12길 15-1, 2층(방이동)',

        }, 
        {
            'num' : '1',
            title:'[공고] 신주발행 공고(구주주 배정방식)',
            date: '2021-01-07',
            lawContent : '상법 제416조에 의거 2021년 1월 7일에 개최한 주식회사 팀프레시의 이사회에서 아래와 같이 신주발행을 결의하였음을 공고합니다.',
            no1Content : '신주의 종류와 수 : 제2종 상환전환우선주식 48,020주',
            no2Content : '신주의 액면가액 : 금 5,000원',
            no3Content : '신주식 발행가액 : 금 457,650원',
            no4Content : '신주배정기준일 : 2021년 1월 22일',
            no5Content : '납입예정일 : 2021년 1월 22일',
            no6Content : '주금납입은행 :  국민은행  송파종합금융센터 지점',
            no7Content : '신주의 인수방법 : 신주배정기준일(2021. 1. 22. 00시)의 주주명부에 등재된 주주에 대하여 소유주식 1주당 주주가 보유한 주식의 비율에 따라 신주식을 배정한다',
            no8Content : '신주인수권 증서에 관한 사항 : 신주인수권 증서를 발행하지 않습니다',
            no1LastContent : null,
            no2LastContent : null,
            company : '주식회사 팀프레시',
            address : '서울특별시 송파구 위례성대로12길 15-1, 2층(방이동)',

        }       
                        
    ]
}

export default boardData